RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/pin_packages/cyhal_psoc6_01_116_bga_ble.c
/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[1] = {
    {0u, 0u, P11_6, P11_6_SMIF_SPI_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[1] = {
    {0u, 0u, P11_5, P11_5_SMIF_SPI_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[1] = {
    {0u, 0u, P11_4, P11_4_SMIF_SPI_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[1] = {
    {0u, 0u, P11_3, P11_3_SMIF_SPI_DATA3},
};

/* Connections for: smif_spi_data4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data4[1] = {
    {0u, 0u, P12_0, P12_0_SMIF_SPI_DATA4},
};

/* Connections for: smif_spi_data5 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data5[1] = {
    {0u, 0u, P12_1, P12_1_SMIF_SPI_DATA5},
};

/* Connections for: smif_spi_data6 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data6[1] = {
    {0u, 0u, P12_2, P12_2_SMIF_SPI_DATA6},
};

/* Connections for: smif_spi_data7 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data7[1] = {
    {0u, 0u, P12_3, P12_3_SMIF_SPI_DATA7},
};

/* Connections for: smif_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select0[1] = {
    {0u, 0u, P11_2, P11_2_SMIF_SPI_SELECT0},
};

/* Connections for: smif_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select1[1] = {
    {0u, 0u, P11_1, P11_1_SMIF_SPI_SELECT1},
};

/* Connections for: smif_spi_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select2[1] = {
    {0u, 0u, P11_0, P11_0_SMIF_SPI_SELECT2},
};

/* Connections for: smif_spi_select3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select3[1] = {
    {0u, 0u, P12_4, P12_4_SMIF_SPI_SELECT3},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[78] = {
    {0u, 0u, P0_0, P0_0_TCPWM0_LINE0},
    {1u, 0u, P0_0, P0_0_TCPWM1_LINE0},
    {0u, 1u, P0_2, P0_2_TCPWM0_LINE1},
    {1u, 1u, P0_2, P0_2_TCPWM1_LINE1},
    {0u, 2u, P0_4, P0_4_TCPWM0_LINE2},
    {1u, 2u, P0_4, P0_4_TCPWM1_LINE2},
    {0u, 3u, P1_0, P1_0_TCPWM0_LINE3},
    {1u, 3u, P1_0, P1_0_TCPWM1_LINE3},
    {0u, 4u, P1_2, P1_2_TCPWM0_LINE4},
    {1u, 12u, P1_2, P1_2_TCPWM1_LINE12},
    {0u, 5u, P1_4, P1_4_TCPWM0_LINE5},
    {1u, 13u, P1_4, P1_4_TCPWM1_LINE13},
    {0u, 4u, P5_0, P5_0_TCPWM0_LINE4},
    {1u, 4u, P5_0, P5_0_TCPWM1_LINE4},
    {0u, 5u, P5_2, P5_2_TCPWM0_LINE5},
    {1u, 5u, P5_2, P5_2_TCPWM1_LINE5},
    {0u, 6u, P5_4, P5_4_TCPWM0_LINE6},
    {1u, 6u, P5_4, P5_4_TCPWM1_LINE6},
    {0u, 7u, P5_6, P5_6_TCPWM0_LINE7},
    {1u, 7u, P5_6, P5_6_TCPWM1_LINE7},
    {0u, 0u, P6_0, P6_0_TCPWM0_LINE0},
    {1u, 8u, P6_0, P6_0_TCPWM1_LINE8},
    {0u, 1u, P6_2, P6_2_TCPWM0_LINE1},
    {1u, 9u, P6_2, P6_2_TCPWM1_LINE9},
    {0u, 2u, P6_4, P6_4_TCPWM0_LINE2},
    {1u, 10u, P6_4, P6_4_TCPWM1_LINE10},
    {0u, 3u, P6_6, P6_6_TCPWM0_LINE3},
    {1u, 11u, P6_6, P6_6_TCPWM1_LINE11},
    {0u, 4u, P7_0, P7_0_TCPWM0_LINE4},
    {1u, 12u, P7_0, P7_0_TCPWM1_LINE12},
    {0u, 5u, P7_2, P7_2_TCPWM0_LINE5},
    {1u, 13u, P7_2, P7_2_TCPWM1_LINE13},
    {0u, 6u, P7_4, P7_4_TCPWM0_LINE6},
    {1u, 14u, P7_4, P7_4_TCPWM1_LINE14},
    {0u, 7u, P7_6, P7_6_TCPWM0_LINE7},
    {1u, 15u, P7_6, P7_6_TCPWM1_LINE15},
    {0u, 0u, P8_0, P8_0_TCPWM0_LINE0},
    {1u, 16u, P8_0, P8_0_TCPWM1_LINE16},
    {0u, 1u, P8_2, P8_2_TCPWM0_LINE1},
    {1u, 17u, P8_2, P8_2_TCPWM1_LINE17},
    {0u, 2u, P8_4, P8_4_TCPWM0_LINE2},
    {1u, 18u, P8_4, P8_4_TCPWM1_LINE18},
    {0u, 3u, P8_6, P8_6_TCPWM0_LINE3},
    {1u, 19u, P8_6, P8_6_TCPWM1_LINE19},
    {0u, 4u, P9_0, P9_0_TCPWM0_LINE4},
    {1u, 20u, P9_0, P9_0_TCPWM1_LINE20},
    {0u, 5u, P9_2, P9_2_TCPWM0_LINE5},
    {1u, 21u, P9_2, P9_2_TCPWM1_LINE21},
    {0u, 7u, P9_4, P9_4_TCPWM0_LINE7},
    {1u, 0u, P9_4, P9_4_TCPWM1_LINE0},
    {0u, 0u, P9_6, P9_6_TCPWM0_LINE0},
    {1u, 1u, P9_6, P9_6_TCPWM1_LINE1},
    {0u, 6u, P10_0, P10_0_TCPWM0_LINE6},
    {1u, 22u, P10_0, P10_0_TCPWM1_LINE22},
    {0u, 7u, P10_2, P10_2_TCPWM0_LINE7},
    {1u, 23u, P10_2, P10_2_TCPWM1_LINE23},
    {0u, 0u, P10_4, P10_4_TCPWM0_LINE0},
    {1u, 0u, P10_4, P10_4_TCPWM1_LINE0},
    {0u, 1u, P10_6, P10_6_TCPWM0_LINE1},
    {1u, 2u, P10_6, P10_6_TCPWM1_LINE2},
    {0u, 1u, P11_0, P11_0_TCPWM0_LINE1},
    {1u, 1u, P11_0, P11_0_TCPWM1_LINE1},
    {0u, 2u, P11_2, P11_2_TCPWM0_LINE2},
    {1u, 2u, P11_2, P11_2_TCPWM1_LINE2},
    {0u, 3u, P11_4, P11_4_TCPWM0_LINE3},
    {1u, 3u, P11_4, P11_4_TCPWM1_LINE3},
    {0u, 4u, P12_0, P12_0_TCPWM0_LINE4},
    {1u, 4u, P12_0, P12_0_TCPWM1_LINE4},
    {0u, 5u, P12_2, P12_2_TCPWM0_LINE5},
    {1u, 5u, P12_2, P12_2_TCPWM1_LINE5},
    {0u, 6u, P12_4, P12_4_TCPWM0_LINE6},
    {1u, 6u, P12_4, P12_4_TCPWM1_LINE6},
    {0u, 7u, P12_6, P12_6_TCPWM0_LINE7},
    {1u, 7u, P12_6, P12_6_TCPWM1_LINE7},
    {0u, 0u, P13_0, P13_0_TCPWM0_LINE0},
    {1u, 8u, P13_0, P13_0_TCPWM1_LINE8},
    {0u, 3u, P13_6, P13_6_TCPWM0_LINE3},
    {1u, 11u, P13_6, P13_6_TCPWM1_LINE11},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[74] = {
    {0u, 0u, P0_1, P0_1_TCPWM0_LINE_COMPL0},
    {1u, 0u, P0_1, P0_1_TCPWM1_LINE_COMPL0},
    {0u, 1u, P0_3, P0_3_TCPWM0_LINE_COMPL1},
    {1u, 1u, P0_3, P0_3_TCPWM1_LINE_COMPL1},
    {0u, 2u, P0_5, P0_5_TCPWM0_LINE_COMPL2},
    {1u, 2u, P0_5, P0_5_TCPWM1_LINE_COMPL2},
    {0u, 3u, P1_1, P1_1_TCPWM0_LINE_COMPL3},
    {1u, 3u, P1_1, P1_1_TCPWM1_LINE_COMPL3},
    {0u, 4u, P1_3, P1_3_TCPWM0_LINE_COMPL4},
    {1u, 12u, P1_3, P1_3_TCPWM1_LINE_COMPL12},
    {0u, 5u, P1_5, P1_5_TCPWM0_LINE_COMPL5},
    {1u, 14u, P1_5, P1_5_TCPWM1_LINE_COMPL14},
    {0u, 4u, P5_1, P5_1_TCPWM0_LINE_COMPL4},
    {1u, 4u, P5_1, P5_1_TCPWM1_LINE_COMPL4},
    {0u, 5u, P5_3, P5_3_TCPWM0_LINE_COMPL5},
    {1u, 5u, P5_3, P5_3_TCPWM1_LINE_COMPL5},
    {0u, 6u, P5_5, P5_5_TCPWM0_LINE_COMPL6},
    {1u, 6u, P5_5, P5_5_TCPWM1_LINE_COMPL6},
    {0u, 0u, P6_1, P6_1_TCPWM0_LINE_COMPL0},
    {1u, 8u, P6_1, P6_1_TCPWM1_LINE_COMPL8},
    {0u, 1u, P6_3, P6_3_TCPWM0_LINE_COMPL1},
    {1u, 9u, P6_3, P6_3_TCPWM1_LINE_COMPL9},
    {0u, 2u, P6_5, P6_5_TCPWM0_LINE_COMPL2},
    {1u, 10u, P6_5, P6_5_TCPWM1_LINE_COMPL10},
    {0u, 3u, P6_7, P6_7_TCPWM0_LINE_COMPL3},
    {1u, 11u, P6_7, P6_7_TCPWM1_LINE_COMPL11},
    {0u, 4u, P7_1, P7_1_TCPWM0_LINE_COMPL4},
    {1u, 12u, P7_1, P7_1_TCPWM1_LINE_COMPL12},
    {0u, 5u, P7_3, P7_3_TCPWM0_LINE_COMPL5},
    {1u, 13u, P7_3, P7_3_TCPWM1_LINE_COMPL13},
    {0u, 6u, P7_5, P7_5_TCPWM0_LINE_COMPL6},
    {1u, 14u, P7_5, P7_5_TCPWM1_LINE_COMPL14},
    {0u, 7u, P7_7, P7_7_TCPWM0_LINE_COMPL7},
    {1u, 15u, P7_7, P7_7_TCPWM1_LINE_COMPL15},
    {0u, 0u, P8_1, P8_1_TCPWM0_LINE_COMPL0},
    {1u, 16u, P8_1, P8_1_TCPWM1_LINE_COMPL16},
    {0u, 1u, P8_3, P8_3_TCPWM0_LINE_COMPL1},
    {1u, 17u, P8_3, P8_3_TCPWM1_LINE_COMPL17},
    {0u, 2u, P8_5, P8_5_TCPWM0_LINE_COMPL2},
    {1u, 18u, P8_5, P8_5_TCPWM1_LINE_COMPL18},
    {0u, 3u, P8_7, P8_7_TCPWM0_LINE_COMPL3},
    {1u, 19u, P8_7, P8_7_TCPWM1_LINE_COMPL19},
    {0u, 4u, P9_1, P9_1_TCPWM0_LINE_COMPL4},
    {1u, 20u, P9_1, P9_1_TCPWM1_LINE_COMPL20},
    {0u, 5u, P9_3, P9_3_TCPWM0_LINE_COMPL5},
    {1u, 21u, P9_3, P9_3_TCPWM1_LINE_COMPL21},
    {0u, 7u, P9_5, P9_5_TCPWM0_LINE_COMPL7},
    {1u, 0u, P9_5, P9_5_TCPWM1_LINE_COMPL0},
    {0u, 0u, P9_7, P9_7_TCPWM0_LINE_COMPL0},
    {1u, 1u, P9_7, P9_7_TCPWM1_LINE_COMPL1},
    {0u, 6u, P10_1, P10_1_TCPWM0_LINE_COMPL6},
    {1u, 22u, P10_1, P10_1_TCPWM1_LINE_COMPL22},
    {0u, 7u, P10_3, P10_3_TCPWM0_LINE_COMPL7},
    {1u, 23u, P10_3, P10_3_TCPWM1_LINE_COMPL23},
    {0u, 0u, P10_5, P10_5_TCPWM0_LINE_COMPL0},
    {1u, 0u, P10_5, P10_5_TCPWM1_LINE_COMPL0},
    {0u, 1u, P11_1, P11_1_TCPWM0_LINE_COMPL1},
    {1u, 1u, P11_1, P11_1_TCPWM1_LINE_COMPL1},
    {0u, 2u, P11_3, P11_3_TCPWM0_LINE_COMPL2},
    {1u, 2u, P11_3, P11_3_TCPWM1_LINE_COMPL2},
    {0u, 3u, P11_5, P11_5_TCPWM0_LINE_COMPL3},
    {1u, 3u, P11_5, P11_5_TCPWM1_LINE_COMPL3},
    {0u, 4u, P12_1, P12_1_TCPWM0_LINE_COMPL4},
    {1u, 4u, P12_1, P12_1_TCPWM1_LINE_COMPL4},
    {0u, 5u, P12_3, P12_3_TCPWM0_LINE_COMPL5},
    {1u, 5u, P12_3, P12_3_TCPWM1_LINE_COMPL5},
    {0u, 6u, P12_5, P12_5_TCPWM0_LINE_COMPL6},
    {1u, 6u, P12_5, P12_5_TCPWM1_LINE_COMPL6},
    {0u, 7u, P12_7, P12_7_TCPWM0_LINE_COMPL7},
    {1u, 7u, P12_7, P12_7_TCPWM1_LINE_COMPL7},
    {0u, 0u, P13_1, P13_1_TCPWM0_LINE_COMPL0},
    {1u, 8u, P13_1, P13_1_TCPWM1_LINE_COMPL8},
    {0u, 3u, P13_7, P13_7_TCPWM0_LINE_COMPL3},
    {1u, 11u, P13_7, P13_7_TCPWM1_LINE_COMPL11},
};

/* Connections for: usb_usb_dm_pad */
const cyhal_resource_pin_mapping_t cyhal_pin_map_usb_usb_dm_pad[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: usb_usb_dp_pad */
const cyhal_resource_pin_mapping_t cyhal_pin_map_usb_usb_dp_pad[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

#endif
